spec/regression/api/authorise_recurring_payment.xml

<?xml version="1.0"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soap:Body>
    <payment:authorise xmlns:payment="http://payment.services.adyen.com" xmlns:recurring="http://recurring.services.adyen.com" xmlns:common="http://common.services.adyen.com">
      <payment:paymentRequest>
        <payment:merchantAccount>YourMerchantAccount</payment:merchantAccount>
        <payment:reference>RecurringPayment-0001</payment:reference>
        <payment:recurring>
          <payment:contract>RECURRING</payment:contract>
        </payment:recurring>
        <payment:selectedRecurringDetailReference>LATEST</payment:selectedRecurringDetailReference>
        <payment:shopperInteraction>ContAuth</payment:shopperInteraction>
        <payment:amount>
          <common:currency>EUR</common:currency>
          <common:value>100</common:value>
        </payment:amount>
        <payment:shopperIP>1.1.1.1</payment:shopperIP>
        <payment:shopperEmail>email@shopper.com</payment:shopperEmail>
        <payment:shopperReference>TheShopperReference</payment:shopperReference>
      </payment:paymentRequest>
    </payment:authorise>
  </soap:Body>
</soap:Envelope>
